/* automatically generated by rust-bindgen 0.58.1 */

pub const _STDINT_H: u32 = 1;
pub const _FEATURES_H: u32 = 1;
pub const _DEFAULT_SOURCE: u32 = 1;
pub const __USE_ISOC11: u32 = 1;
pub const __USE_ISOC99: u32 = 1;
pub const __USE_ISOC95: u32 = 1;
pub const __USE_POSIX_IMPLICITLY: u32 = 1;
pub const _POSIX_SOURCE: u32 = 1;
pub const _POSIX_C_SOURCE: u32 = 200809;
pub const __USE_POSIX: u32 = 1;
pub const __USE_POSIX2: u32 = 1;
pub const __USE_POSIX199309: u32 = 1;
pub const __USE_POSIX199506: u32 = 1;
pub const __USE_XOPEN2K: u32 = 1;
pub const __USE_XOPEN2K8: u32 = 1;
pub const _ATFILE_SOURCE: u32 = 1;
pub const __USE_MISC: u32 = 1;
pub const __USE_ATFILE: u32 = 1;
pub const __USE_FORTIFY_LEVEL: u32 = 0;
pub const __GLIBC_USE_DEPRECATED_GETS: u32 = 0;
pub const _STDC_PREDEF_H: u32 = 1;
pub const __STDC_IEC_559__: u32 = 1;
pub const __STDC_IEC_559_COMPLEX__: u32 = 1;
pub const __STDC_ISO_10646__: u32 = 201706;
pub const __STDC_NO_THREADS__: u32 = 1;
pub const __GNU_LIBRARY__: u32 = 6;
pub const __GLIBC__: u32 = 2;
pub const __GLIBC_MINOR__: u32 = 27;
pub const _SYS_CDEFS_H: u32 = 1;
pub const __glibc_c99_flexarr_available: u32 = 1;
pub const __WORDSIZE: u32 = 64;
pub const __WORDSIZE_TIME64_COMPAT32: u32 = 1;
pub const __SYSCALL_WORDSIZE: u32 = 64;
pub const __HAVE_GENERIC_SELECTION: u32 = 1;
pub const __GLIBC_USE_LIB_EXT2: u32 = 0;
pub const __GLIBC_USE_IEC_60559_BFP_EXT: u32 = 0;
pub const __GLIBC_USE_IEC_60559_FUNCS_EXT: u32 = 0;

pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const MAX_SHAPE_DIM_NUM: u32 = 4;
pub const TENGINE_DT_FP32: u32 = 0;
pub const TENGINE_DT_FP16: u32 = 1;
pub const TENGINE_DT_INT8: u32 = 2;
pub const TENGINE_DT_UINT8: u32 = 3;
pub const TENGINE_DT_INT32: u32 = 4;
pub const TENGINE_DT_INT16: u32 = 5;
pub const TENGINE_LAYOUT_NCHW: u32 = 0;
pub const TENGINE_LAYOUT_NHWC: u32 = 1;
pub const TENSOR_TYPE_UNKNOWN: u32 = 0;
pub const TENSOR_TYPE_VAR: u32 = 1;
pub const TENSOR_TYPE_CONST: u32 = 2;
pub const TENSOR_TYPE_INPUT: u32 = 3;
pub const TENSOR_TYPE_DEP: u32 = 4;
pub const TENGINE_CLUSTER_ALL: u32 = 0;
pub const TENGINE_CLUSTER_BIG: u32 = 1;
pub const TENGINE_CLUSTER_MEDIUM: u32 = 2;
pub const TENGINE_CLUSTER_LITTLE: u32 = 3;
pub const TENGINE_MODE_FP32: u32 = 0;
pub const TENGINE_MODE_FP16: u32 = 1;
pub const TENGINE_MODE_HYBRID_INT8: u32 = 2;
pub const TENGINE_MODE_UINT8: u32 = 3;
pub const TENGINE_MODE_INT8: u32 = 4;
pub const NODE_DUMP_ACTION_DISABLE: u32 = 0;
pub const NODE_DUMP_ACTION_ENABLE: u32 = 1;
pub const NODE_DUMP_ACTION_START: u32 = 2;
pub const NODE_DUMP_ACTION_STOP: u32 = 3;
pub const NODE_DUMP_ACTION_GET: u32 = 4;
pub const GRAPH_PERF_STAT_DISABLE: u32 = 0;
pub const GRAPH_PERF_STAT_ENABLE: u32 = 1;
pub const GRAPH_PERF_STAT_STOP: u32 = 2;
pub const GRAPH_PERF_STAT_START: u32 = 3;
pub const GRAPH_PERF_STAT_RESET: u32 = 4;
pub const GRAPH_PERF_STAT_GET: u32 = 5;
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[test]
fn bindgen_test_layout___fsid_t() {
    assert_eq!(
        ::std::mem::size_of::<__fsid_t>(),
        8usize,
        concat!("Size of: ", stringify!(__fsid_t))
    );
    assert_eq!(
        ::std::mem::align_of::<__fsid_t>(),
        4usize,
        concat!("Alignment of ", stringify!(__fsid_t))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<__fsid_t>())).__val as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__fsid_t),
            "::",
            stringify!(__val)
        )
    );
}
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type int_least8_t = ::std::os::raw::c_schar;
pub type int_least16_t = ::std::os::raw::c_short;
pub type int_least32_t = ::std::os::raw::c_int;
pub type int_least64_t = ::std::os::raw::c_long;
pub type uint_least8_t = ::std::os::raw::c_uchar;
pub type uint_least16_t = ::std::os::raw::c_ushort;
pub type uint_least32_t = ::std::os::raw::c_uint;
pub type uint_least64_t = ::std::os::raw::c_ulong;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
pub type size_t = ::std::os::raw::c_ulong;
pub type wchar_t = ::std::os::raw::c_int;
#[repr(C)]
#[repr(align(16))]
#[derive(Debug, Copy, Clone)]
pub struct max_align_t {
    pub __clang_max_align_nonce1: ::std::os::raw::c_longlong,
    pub __bindgen_padding_0: u64,
    pub __clang_max_align_nonce2: u128,
}
#[test]
fn bindgen_test_layout_max_align_t() {
    assert_eq!(
        ::std::mem::size_of::<max_align_t>(),
        32usize,
        concat!("Size of: ", stringify!(max_align_t))
    );
    assert_eq!(
        ::std::mem::align_of::<max_align_t>(),
        16usize,
        concat!("Alignment of ", stringify!(max_align_t))
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce1 as *const _ as usize
        },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce1)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<max_align_t>())).__clang_max_align_nonce2 as *const _ as usize
        },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(max_align_t),
            "::",
            stringify!(__clang_max_align_nonce2)
        )
    );
}
pub const log_level_LOG_EMERG: log_level = 0;
pub const log_level_LOG_ALERT: log_level = 1;
pub const log_level_LOG_CRIT: log_level = 2;
pub const log_level_LOG_ERR: log_level = 3;
pub const log_level_LOG_WARNING: log_level = 4;
pub const log_level_LOG_NOTICE: log_level = 5;
pub const log_level_LOG_INFO: log_level = 6;
pub const log_level_LOG_DEBUG: log_level = 7;
pub type log_level = ::std::os::raw::c_uint;
pub const graph_exec_event_GRAPH_EXEC_START: graph_exec_event = 0;
pub const graph_exec_event_GRAPH_EXEC_SUSPEND: graph_exec_event = 1;
pub const graph_exec_event_GRAPH_EXEC_RESUME: graph_exec_event = 2;
pub const graph_exec_event_GRAPH_EXEC_ABORT: graph_exec_event = 3;
pub const graph_exec_event_GRAPH_EXEC_DONE: graph_exec_event = 4;
pub type graph_exec_event = ::std::os::raw::c_uint;
pub const graph_exec_stat_GRAPH_STAT_CREATED: graph_exec_stat = 0;
pub const graph_exec_stat_GRAPH_STAT_READY: graph_exec_stat = 1;
pub const graph_exec_stat_GRAPH_STAT_RUNNING: graph_exec_stat = 2;
pub const graph_exec_stat_GRAPH_STAT_DONE: graph_exec_stat = 3;
pub const graph_exec_stat_GRAPH_STAT_ERROR: graph_exec_stat = 4;
pub type graph_exec_stat = ::std::os::raw::c_uint;
pub const device_policy_DEFAULT_POLICY: device_policy = 0;
pub const device_policy_LATENCY_POLICY: device_policy = 1;
pub const device_policy_LOW_POWER_POLICY: device_policy = 2;
pub type device_policy = ::std::os::raw::c_uint;
pub type context_t = *mut ::std::os::raw::c_void;
pub type graph_t = *mut ::std::os::raw::c_void;
pub type tensor_t = *mut ::std::os::raw::c_void;
pub type node_t = *mut ::std::os::raw::c_void;
pub type event_handler_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: graph_t,
        arg2: ::std::os::raw::c_int,
        arg: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type log_print_t =
    ::std::option::Option<unsafe extern "C" fn(arg1: *const ::std::os::raw::c_char)>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct options {
    pub num_thread: ::std::os::raw::c_int,
    pub cluster: ::std::os::raw::c_int,
    pub precision: ::std::os::raw::c_int,
    pub affinity: u64,
}
#[test]
fn bindgen_test_layout_options() {
    assert_eq!(
        ::std::mem::size_of::<options>(),
        24usize,
        concat!("Size of: ", stringify!(options))
    );
    assert_eq!(
        ::std::mem::align_of::<options>(),
        8usize,
        concat!("Alignment of ", stringify!(options))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<options>())).num_thread as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(options),
            "::",
            stringify!(num_thread)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<options>())).cluster as *const _ as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(options),
            "::",
            stringify!(cluster)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<options>())).precision as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(options),
            "::",
            stringify!(precision)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<options>())).affinity as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(options),
            "::",
            stringify!(affinity)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct perf_info {
    pub name: *const ::std::os::raw::c_char,
    pub dev_name: *const ::std::os::raw::c_char,
    pub count: u32,
    pub min: u32,
    pub max: u32,
    pub total_time: u64,
    pub base: u32,
}
#[test]
fn bindgen_test_layout_perf_info() {
    assert_eq!(
        ::std::mem::size_of::<perf_info>(),
        48usize,
        concat!("Size of: ", stringify!(perf_info))
    );
    assert_eq!(
        ::std::mem::align_of::<perf_info>(),
        8usize,
        concat!("Alignment of ", stringify!(perf_info))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).dev_name as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(dev_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).count as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).min as *const _ as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(min)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).max as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(max)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).total_time as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(total_time)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<perf_info>())).base as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(perf_info),
            "::",
            stringify!(base)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct custom_kernel_tensor {
    pub dim: [::std::os::raw::c_int; 4usize],
    pub dim_num: ::std::os::raw::c_int,
    pub element_num: ::std::os::raw::c_int,
    pub element_size: ::std::os::raw::c_int,
    pub data_type: ::std::os::raw::c_int,
    pub dev_type: ::std::os::raw::c_int,
    pub layout_type: ::std::os::raw::c_int,
    pub quant_type: ::std::os::raw::c_int,
    pub scale: *mut f32,
    pub zero_point: *mut ::std::os::raw::c_int,
    pub quant_number: *mut ::std::os::raw::c_int,
    pub data: *mut ::std::os::raw::c_void,
    pub dev_mem: *mut ::std::os::raw::c_void,
    pub mapped_mem: *mut ::std::os::raw::c_void,
}
#[test]
fn bindgen_test_layout_custom_kernel_tensor() {
    assert_eq!(
        ::std::mem::size_of::<custom_kernel_tensor>(),
        96usize,
        concat!("Size of: ", stringify!(custom_kernel_tensor))
    );
    assert_eq!(
        ::std::mem::align_of::<custom_kernel_tensor>(),
        8usize,
        concat!("Alignment of ", stringify!(custom_kernel_tensor))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).dim as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(dim)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).dim_num as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(dim_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<custom_kernel_tensor>())).element_num as *const _ as usize
        },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(element_num)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<custom_kernel_tensor>())).element_size as *const _ as usize
        },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(element_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).data_type as *const _ as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(data_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).dev_type as *const _ as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(dev_type)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<custom_kernel_tensor>())).layout_type as *const _ as usize
        },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(layout_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).quant_type as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(quant_type)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).scale as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(scale)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).zero_point as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(zero_point)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<custom_kernel_tensor>())).quant_number as *const _ as usize
        },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(quant_number)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).data as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).dev_mem as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(dev_mem)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_tensor>())).mapped_mem as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_tensor),
            "::",
            stringify!(mapped_mem)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct custom_kernel_ops {
    pub kernel_name: *const ::std::os::raw::c_char,
    pub op: *const ::std::os::raw::c_char,
    pub force: ::std::os::raw::c_int,
    pub kernel_param: *mut ::std::os::raw::c_void,
    pub kernel_param_size: ::std::os::raw::c_int,
    #[doc = " @brief generate output shape according to input shapes"]
    #[doc = "        if not implemented, set it to NULL."]
    #[doc = ""]
    #[doc = " @param [in]  ops: The point of custom defined kernel."]
    #[doc = " @param [in]  inputs[]:  pointer array to the shape of input tensors."]
    #[doc = "                         the shape has MAX_SHAPE_DIM_NUM elements,"]
    #[doc = "                         and element with value 0  means the end of the shape."]
    #[doc = " @param [in]  input_num: The number of input tensors."]
    #[doc = " @param [out] outputs[]: pointer array to the shape of output tensors."]
    #[doc = "                         the memory has been allocated already"]
    #[doc = " @param [in]  output_num: The number of output tensors"]
    #[doc = " @param [in]  layout: the graph layout is NHWC or NCHW"]
    #[doc = ""]
    #[doc = " @return 0: success, -1: fail."]
    pub infer_shape: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *const ::std::os::raw::c_int,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *mut ::std::os::raw::c_int,
            output_num: ::std::os::raw::c_int,
            layout: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Get the inplace input tensor index for an output tensor."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] output_idx: The index of custom defined kernel output."]
    #[doc = ""]
    #[doc = " @return the inplace input tensor index for an output tensor."]
    #[doc = "         if the output tensor is not an inplace one, return -1."]
    pub inplace_info: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            output_idx: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Check if the kernel can work on the input and output shapes."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] inputs[]: The custom kernel tensors for input."]
    #[doc = " @param [in] input_num: The number of the input tensors."]
    #[doc = " @param [in] outputs[]: The custom kernel output tensor for output"]
    #[doc = " @param [in] output_num: The number of the output tensors."]
    #[doc = ""]
    #[doc = " @return 0 if the input and output are supported"]
    #[doc = "         otherwise, return -1."]
    #[doc = ""]
    #[doc = " notes: If not implemented, set it NULL, which means always return 0."]
    pub bind: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *const custom_kernel_tensor,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *const custom_kernel_tensor,
            output_num: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Prepare for run graph."]
    #[doc = "        dynamic_shape means it is not an abnormal case when input_num is zero."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] inputs[]: The custom defined kernel input tensor."]
    #[doc = " @param [in] input_num: The number of the custom defined kernel input tensor."]
    #[doc = " @param [in] outputs[]: The custom defined kernel output tensor."]
    #[doc = " @param [in] output_num: The number of the custom defined kernel output tensor."]
    #[doc = " @param [in] dynamic_shape: It is not an abnormal case when input_num is zero."]
    #[doc = ""]
    #[doc = " @return 0: success, -1: fail."]
    pub prerun: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *mut custom_kernel_tensor,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *mut custom_kernel_tensor,
            output_num: ::std::os::raw::c_int,
            dynamic_shape: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Reshape the graph."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] inputs[]: The custom defined kernel input tensor."]
    #[doc = " @param [in] input_num: The number of the custom defined kernel input tensor."]
    #[doc = " @param [in] outputs[]: The custom defined kernel output tensor."]
    #[doc = " @param [in] output_num: The number of the custom defined kernel output tensor."]
    #[doc = ""]
    #[doc = " @return 0: success, -1: fail."]
    #[doc = ""]
    #[doc = " notes: It will be called, when input shape changed."]
    #[doc = "        After prerun() has been called, need to reclaim and re-allocate run-time"]
    #[doc = "        resource depends on input shape."]
    pub reshape: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *mut custom_kernel_tensor,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *mut custom_kernel_tensor,
            output_num: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Run the graph."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] inputs[]: The custom defined kernel input tensor."]
    #[doc = " @param [in] input_num: The number of the custom defined kernel input tensor."]
    #[doc = " @param [in] outputs[]: The custom defined kernel output tensor."]
    #[doc = " @param [in] output_num: The number of the custom defined kernel output tensor."]
    #[doc = ""]
    #[doc = " @return 0: success, -1: fail."]
    pub run: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *mut custom_kernel_tensor,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *mut custom_kernel_tensor,
            output_num: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Pause the graph and release the resources used when the graph is running."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = " @param [in] inputs[]: The custom defined kernel input tensor."]
    #[doc = " @param [in] input_num: The number of the custom defined kernel input tensor."]
    #[doc = " @param [in] outputs[]: The custom defined kernel output tensor."]
    #[doc = " @param [in] output_num: The number of the custom defined kernel output tensor."]
    #[doc = ""]
    #[doc = " @return 0: success, -1: fail."]
    pub postrun: ::std::option::Option<
        unsafe extern "C" fn(
            ops: *mut custom_kernel_ops,
            inputs: *mut *mut custom_kernel_tensor,
            input_num: ::std::os::raw::c_int,
            outputs: *mut *mut custom_kernel_tensor,
            output_num: ::std::os::raw::c_int,
        ) -> ::std::os::raw::c_int,
    >,
    #[doc = " @brief Free the resource allocated this ops implementation."]
    #[doc = ""]
    #[doc = " @param [in] ops: The point of custom defined kernel."]
    #[doc = ""]
    #[doc = " @return None."]
    pub release: ::std::option::Option<unsafe extern "C" fn(ops: *mut custom_kernel_ops)>,
}
#[test]
fn bindgen_test_layout_custom_kernel_ops() {
    assert_eq!(
        ::std::mem::size_of::<custom_kernel_ops>(),
        104usize,
        concat!("Size of: ", stringify!(custom_kernel_ops))
    );
    assert_eq!(
        ::std::mem::align_of::<custom_kernel_ops>(),
        8usize,
        concat!("Alignment of ", stringify!(custom_kernel_ops))
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).kernel_name as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(kernel_name)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).op as *const _ as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(op)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).force as *const _ as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(force)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).kernel_param as *const _ as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(kernel_param)
        )
    );
    assert_eq!(
        unsafe {
            &(*(::std::ptr::null::<custom_kernel_ops>())).kernel_param_size as *const _ as usize
        },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(kernel_param_size)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).infer_shape as *const _ as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(infer_shape)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).inplace_info as *const _ as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(inplace_info)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).bind as *const _ as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(bind)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).prerun as *const _ as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(prerun)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).reshape as *const _ as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(reshape)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).run as *const _ as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(run)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).postrun as *const _ as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(postrun)
        )
    );
    assert_eq!(
        unsafe { &(*(::std::ptr::null::<custom_kernel_ops>())).release as *const _ as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(custom_kernel_ops),
            "::",
            stringify!(release)
        )
    );
}
extern "C" {
    #[doc = " @brief Initialize the tengine, only can be called once."]
    #[doc = ""]
    #[doc = " @return 0: Success, -1: Fail."]
    pub fn init_tengine() -> ::std::os::raw::c_int;
}
extern "C" {
    #[doc = " @brief Release the tengine, only can be called once."]
    #[doc = ""]
    #[doc = " @return none."]
    pub fn release_tengine();
}
extern "C" {
    #[doc = " @brief Get the version of the tengine."]
    #[doc = ""]
    #[doc = " @return const char * of version string."]
    pub fn get_tengine_version() -> *const ::std::os::raw::c_char;
}
extern "C" {
    #[doc = " @brief Check the run-time library supports the verson."]
    #[doc = "        app developer should call get_tengine_version() to save the version used"]
    #[doc = "        during developping."]
    #[doc = ""]
    #[doc = ""]
